In [15]:
import pandas as pd
import matplotlib.pyplot as plt

In [22]:
df = pd.read_csv('train.csv')
df = df.drop(['PassengerId','Name'],axis=1)

df['female'] = df['Sex'].apply(lambda sex: 1 if sex == 'female' else 0)
df = df.drop(['Sex'],axis=1)

df.head()

,Survived,Pclass,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,female
0,0,3,22.0,1,0,A/5 21171,7.2500,NaN,S,0
1,1,1,38.0,1,0,PC 17599,71.2833,C85,C,1
2,1,3,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,1
3,1,1,35.0,1,0,113803,53.1000,C123,S,1
4,0,3,35.0,0,0,373450,8.0500,NaN,S,0

In [23]:
df.Embarked

0      S
1      C
2      S
3      S
4      S
      ..
886    S
887    S
888    S
889    C
890    Q
Name: Embarked, Length: 891, dtype: object

In [17]:
x = df.drop(['Survived'],axis=1)
y = df['Survived']